input_openfoam/tutorials/incompressible/overSimpleFoam/aeroFoil/background_overset/Allrun.pre
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication extrudeMesh
runApplication createPatch -overwrite
mergeMeshes . ../aeroFoil_overset -overwrite
runApplication topoSet

restore0Dir

# Use cellSets to write zoneID
runApplication setFields

#------------------------------------------------------------------------------
